ch7lin-cyber/myNXPs16_Prj/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitInterBusPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitInterBusPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t GPIO_1_InterBus_ENB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 31)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_GPIO, BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_PORT, BOARD_INITINTERBUSPINS_GPIO_1_InterBus_ENB_PIN, &GPIO_1_InterBus_ENB_config);

    gpio_pin_config_t GPIO_1_2_InterBus_PreENB_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 40)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_GPIO, BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_PORT, BOARD_INITINTERBUSPINS_GPIO_1_2_InterBus_PreENB_PIN, &GPIO_1_2_InterBus_PreENB_config);

    gpio_pin_config_t GPIO_0_2_InterBus_PreENA_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin 57)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_GPIO, BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_PORT, BOARD_INITINTERBUSPINS_GPIO_0_2_InterBus_PreENA_PIN, &GPIO_0_2_InterBus_PreENA_config);

    gpio_pin_config_t GPIO_3_InterBus_CLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin 43)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_GPIO, BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_PORT, BOARD_INITINTERBUSPINS_GPIO_3_InterBus_CLK_PIN, &GPIO_3_InterBus_CLK_config);

    gpio_pin_config_t GPIO_0_InterBus_ENA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin 30)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_GPIO, BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_PORT, BOARD_INITINTERBUSPINS_GPIO_0_InterBus_ENA_PIN, &GPIO_0_InterBus_ENA_config);

    gpio_pin_config_t GPIO_4_InterBus_FB_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin 42)  */
    GPIO_PinInit(BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_GPIO, BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_PORT, BOARD_INITINTERBUSPINS_GPIO_4_InterBus_FB_PIN, &GPIO_4_InterBus_FB_config);
    /* PIO1_17 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort1Pin17ToPintsel);

    IOCON->PIO[1][10] = ((IOCON->PIO[1][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT110 (pin 40) is configured as PIO1_10. */
                         | IOCON_PIO_FUNC(PIO1_10_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-up.
                          * Pull-up resistor enabled. */
                         | IOCON_PIO_MODE(PIO1_10_MODE_PULL_UP)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_10_DIGIMODE_DIGITAL));

    IOCON->PIO[1][14] = ((IOCON->PIO[1][14] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT114 (pin 57) is configured as PIO1_14. */
                         | IOCON_PIO_FUNC(PIO1_14_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO1_14_MODE_PULL_DOWN)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_14_DIGIMODE_DIGITAL));

    IOCON->PIO[1][17] = ((IOCON->PIO[1][17] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT117 (pin 43) is configured as PIO1_17. */
                         | IOCON_PIO_FUNC(PIO1_17_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO1_17_MODE_PULL_DOWN)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO1_17_DIGIMODE_DIGITAL));

    IOCON->PIO[1][21] = ((IOCON->PIO[1][21] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT121 (pin 30) is configured as PIO1_21. */
                         | IOCON_PIO_FUNC(PIO1_21_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO1_21_MODE_PULL_DOWN)

